pkg/wsman/wsmantesting/responses/amt/tls/credentialcontext/put.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope
	xmlns:a="http://www.w3.org/2003/05/soap-envelope"
	xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
	xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
	xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
	xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
	xmlns:g="http://intel.com/wbem/wscim/1/amt-schema/1/AMT_TLSCredentialContext"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<a:Header>
		<b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
		<b:RelatesTo>11</b:RelatesTo>
		<b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/PutResponse</b:Action>
		<b:MessageID>uuid:00000000-8086-8086-8086-00000004CD7E</b:MessageID>
		<c:ResourceURI>http://intel.com/wbem/wscim/1/amt-schema/1/AMT_TLSCredentialContext</c:ResourceURI>
	</a:Header>
	<a:Body>
		<g:AMT_TLSCredentialContext>
			<g:ElementInContext>
				<b:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:Address>
				<b:ReferenceParameters>
					<c:ResourceURI>http://intel.com/wbem/wscim/1/amt-schema/1/AMT_PublicKeyCertificate</c:ResourceURI>
					<c:SelectorSet>
						<c:Selector Name="InstanceID">Intel(r) AMT Certificate: Handle: 4</c:Selector>
					</c:SelectorSet>
				</b:ReferenceParameters>
			</g:ElementInContext>
			<g:ElementProvidingContext>
				<b:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:Address>
				<b:ReferenceParameters>
					<c:ResourceURI>http://intel.com/wbem/wscim/1/amt-schema/1/AMT_TLSProtocolEndpointCollection</c:ResourceURI>
					<c:SelectorSet>
						<c:Selector Name="ElementName">TLSProtocolEndpoint Instances Collection</c:Selector>
					</c:SelectorSet>
				</b:ReferenceParameters>
			</g:ElementProvidingContext>
		</g:AMT_TLSCredentialContext>
	</a:Body>
</a:Envelope>